; domain
(define (domain grid)
(:requirements :strips)
(:predicates (conn ?x ?y)
             (key-shape ?k ?s)
             (lock-shape ?x ?s)
             (at ?r ?x )
	     (at-robot ?x)
             (place ?p)
             (key ?k)
             (shape ?s)
             (locked ?x)
             (holding ?k)
             (open ?x)
             (arm-empty ))



(:action unlock
:parameters (?curpos ?lockpos ?key ?shape)
:precondition (and (place ?curpos) (place ?lockpos) (key ?key) (shape ?shape)
          (conn ?curpos ?lockpos) (key-shape ?key ?shape)
                   (lock-shape ?lockpos ?shape) (at-robot ?curpos)
                   (locked ?lockpos) (holding ?key))
:effect (and  (open ?lockpos) (not (locked ?lockpos))))


(:action move
:parameters (?curpos ?nextpos)
:precondition (and (place ?curpos) (place ?nextpos)
               (at-robot ?curpos) (conn ?curpos ?nextpos) (open ?nextpos))
:effect (and (at-robot ?nextpos) (not (at-robot ?curpos))))

(:action pickup
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key)
                  (at-robot ?curpos) (at ?key ?curpos) (arm-empty ))
:effect (and (holding ?key)
   (not (at ?key ?curpos)) (not (arm-empty ))))


(:action pickup-and-loose
:parameters (?curpos ?newkey ?oldkey)
:precondition (and (place ?curpos) (key ?newkey) (key ?oldkey)
                  (at-robot ?curpos) (holding ?oldkey) (at ?newkey ?curpos))
:effect (and (holding ?newkey) (at ?oldkey ?curpos)
        (not (holding ?oldkey)) (not (at ?newkey ?curpos))))

(:action putdown
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key)
                  (at-robot ?curpos) (holding ?key))
:effect (and (arm-empty ) (at ?key ?curpos) (not (holding ?key)))))

; problem
(define (problem grid-3-5-5-6-10)
    (:domain grid)
    (:objects
    pos0-0 pos0-1 pos0-2 pos0-3 pos0-4 pos1-0 pos1-1 pos1-2 pos1-3 pos1-4 pos2-0 pos2-1 pos2-2 pos2-3 pos2-4
    shape0 shape1 shape2 shape3 shape4
    key0 key1 key2 key3 key4 key5
    )

    (:init
       (arm-empty)

       (place pos0-0)
       (place pos0-1)
       (place pos0-2)
       (place pos0-3)
       (place pos0-4)
       (place pos1-0)
       (place pos1-1)
       (place pos1-2)
       (place pos1-3)
       (place pos1-4)
       (place pos2-0)
       (place pos2-1)
       (place pos2-2)
       (place pos2-3)
       (place pos2-4)
       (shape shape0)
       (shape shape1)
       (shape shape2)
       (shape shape3)
       (shape shape4)
       (key key0)
       (key key1)
       (key key2)
       (key key3)
       (key key4)
       (key key5)

       (conn pos0-0 pos1-0)
       (conn pos0-0 pos0-1)
       (conn pos0-1 pos1-1)
       (conn pos0-1 pos0-2)
       (conn pos0-1 pos0-0)
       (conn pos0-2 pos1-2)
       (conn pos0-2 pos0-3)
       (conn pos0-2 pos0-1)
       (conn pos0-3 pos1-3)
       (conn pos0-3 pos0-4)
       (conn pos0-3 pos0-2)
       (conn pos0-4 pos1-4)
       (conn pos0-4 pos0-3)
       (conn pos1-0 pos2-0)
       (conn pos1-0 pos1-1)
       (conn pos1-0 pos0-0)
       (conn pos1-1 pos2-1)
       (conn pos1-1 pos1-2)
       (conn pos1-1 pos0-1)
       (conn pos1-1 pos1-0)
       (conn pos1-2 pos2-2)
       (conn pos1-2 pos1-3)
       (conn pos1-2 pos0-2)
       (conn pos1-2 pos1-1)
       (conn pos1-3 pos2-3)
       (conn pos1-3 pos1-4)
       (conn pos1-3 pos0-3)
       (conn pos1-3 pos1-2)
       (conn pos1-4 pos2-4)
       (conn pos1-4 pos0-4)
       (conn pos1-4 pos1-3)
       (conn pos2-0 pos2-1)
       (conn pos2-0 pos1-0)
       (conn pos2-1 pos2-2)
       (conn pos2-1 pos1-1)
       (conn pos2-1 pos2-0)
       (conn pos2-2 pos2-3)
       (conn pos2-2 pos1-2)
       (conn pos2-2 pos2-1)
       (conn pos2-3 pos2-4)
       (conn pos2-3 pos1-3)
       (conn pos2-3 pos2-2)
       (conn pos2-4 pos1-4)
       (conn pos2-4 pos2-3)
       (locked pos0-4)
       (locked pos1-2)
       (locked pos1-3)
       (locked pos1-1)
       (locked pos2-0)
       (locked pos2-1)
       (locked pos1-4)
       (locked pos2-4)
       (locked pos2-2)
       (locked pos0-2)
       (lock-shape  pos0-4 shape0)
       (lock-shape  pos1-2 shape1)
       (lock-shape  pos1-3 shape2)
       (lock-shape  pos1-1 shape3)
       (lock-shape  pos2-0 shape4)
       (lock-shape  pos2-1 shape3)
       (lock-shape  pos1-4 shape1)
       (lock-shape  pos2-4 shape3)
       (lock-shape  pos2-2 shape3)
       (lock-shape  pos0-2 shape4)
       (open pos0-0)
       (open pos0-1)
       (open pos0-3)
       (open pos1-0)
       (open pos2-3)

       (key-shape  key0 shape0)
       (key-shape  key1 shape1)
       (key-shape  key2 shape2)
       (key-shape  key3 shape3)
       (key-shape  key4 shape4)
       (key-shape  key5 shape1)
       (at key0 pos0-3)
       (at key1 pos0-1)
       (at key2 pos0-3)
       (at key3 pos0-4)
       (at key4 pos1-1)
       (at key5 pos0-2)
       (at-robot pos0-3)
    )

    (:goal (and
       (at key2 pos1-0)
    )))

; plan
1. (pickup pos0-3 key2)
   deleted: (at key2 pos0-3) (arm-empty)
   added: (holding key2)
   goals met: 0 of 1
2. (unlock pos0-3 pos1-3 key2 shape2)
   deleted: (locked pos1-3)
   added: (open pos1-3)
   goals met: 0 of 1
3. (pickup-and-loose pos0-3 key0 key2)
   deleted: (holding key2) (at key0 pos0-3)
   added: (holding key0) (at key2 pos0-3)
   goals met: 0 of 1
4. (unlock pos0-3 pos0-4 key0 shape0)
   deleted: (locked pos0-4)
   added: (open pos0-4)
   goals met: 0 of 1
5. (move pos0-3 pos0-4)
   deleted: (at-robot pos0-3)
   added: (at-robot pos0-4)
   goals met: 0 of 1
6. (pickup-and-loose pos0-4 key3 key0)
   deleted: (holding key0) (at key3 pos0-4)
   added: (holding key3) (at key0 pos0-4)
   goals met: 0 of 1
7. (move pos0-4 pos0-3)
   deleted: (at-robot pos0-4)
   added: (at-robot pos0-3)
   goals met: 0 of 1
8. (move pos0-3 pos1-3)
   deleted: (at-robot pos0-3)
   added: (at-robot pos1-3)
   goals met: 0 of 1
9. (move pos1-3 pos2-3)
   deleted: (at-robot pos1-3)
   added: (at-robot pos2-3)
   goals met: 0 of 1
10. (unlock pos2-3 pos2-2 key3 shape3)
   deleted: (locked pos2-2)
   added: (open pos2-2)
   goals met: 0 of 1
11. (move pos2-3 pos2-2)
   deleted: (at-robot pos2-3)
   added: (at-robot pos2-2)
   goals met: 0 of 1
12. (unlock pos2-2 pos2-1 key3 shape3)
   deleted: (locked pos2-1)
   added: (open pos2-1)
   goals met: 0 of 1
13. (move pos2-2 pos2-1)
   deleted: (at-robot pos2-2)
   added: (at-robot pos2-1)
   goals met: 0 of 1
14. (unlock pos2-1 pos1-1 key3 shape3)
   deleted: (locked pos1-1)
   added: (open pos1-1)
   goals met: 0 of 1
15. (move pos2-1 pos2-2)
   deleted: (at-robot pos2-1)
   added: (at-robot pos2-2)
   goals met: 0 of 1
16. (move pos2-2 pos2-3)
   deleted: (at-robot pos2-2)
   added: (at-robot pos2-3)
   goals met: 0 of 1
17. (move pos2-3 pos1-3)
   deleted: (at-robot pos2-3)
   added: (at-robot pos1-3)
   goals met: 0 of 1
18. (move pos1-3 pos0-3)
   deleted: (at-robot pos1-3)
   added: (at-robot pos0-3)
   goals met: 0 of 1
19. (pickup-and-loose pos0-3 key2 key3)
   deleted: (holding key3) (at key2 pos0-3)
   added: (holding key2) (at key3 pos0-3)
   goals met: 0 of 1
20. (move pos0-3 pos1-3)
   deleted: (at-robot pos0-3)
   added: (at-robot pos1-3)
   goals met: 0 of 1
21. (move pos1-3 pos2-3)
   deleted: (at-robot pos1-3)
   added: (at-robot pos2-3)
   goals met: 0 of 1
22. (move pos2-3 pos2-2)
   deleted: (at-robot pos2-3)
   added: (at-robot pos2-2)
   goals met: 0 of 1
23. (move pos2-2 pos2-1)
   deleted: (at-robot pos2-2)
   added: (at-robot pos2-1)
   goals met: 0 of 1
24. (move pos2-1 pos1-1)
   deleted: (at-robot pos2-1)
   added: (at-robot pos1-1)
   goals met: 0 of 1
25. (move pos1-1 pos1-0)
   deleted: (at-robot pos1-1)
   added: (at-robot pos1-0)
   goals met: 0 of 1
26. (putdown pos1-0 key2)
   deleted: (holding key2)
   added: (arm-empty) (at key2 pos1-0)
   goals met: 1 of 1
